Revit 2027 API
FailureMessageAccessor.GetDescriptionText Method
 Retrieves the description of the failure.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetDescriptionText()
Public Function GetDescriptionText As String
public:
String^ GetDescriptionText()
member GetDescriptionText : unit -> string
Return Value
String
 The description text.
Exceptions
Exception | Condition
InvalidOperationException |  This FailureMessageAccessor has not been properly initialized.
See Also
Reference
FailureMessageAccessor Class
Autodesk.Revit.DB Namespace